---
title: RebarSpliceOptions
classe: Autodesk.Revit.DB.Structure.RebarSpliceOptions
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# RebarSpliceOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `rebarSpliceOptions.IsValidObject` | Boolean |
| `RebarSplicePosition SplicePosition { get; set; }` | `rebarSpliceOptions.SplicePosition` | RebarSplicePosition |
| `ElementId SpliceTypeId { get; set; }` | `rebarSpliceOptions.SpliceTypeId` | ElementId |
| `Void Dispose()` | `rebarSpliceOptions.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```